---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AppearanceAssetElement
source: html/e1c2d161-4b00-adbc-5b8a-6a93a437d23b.htm
---
# AppearanceAssetElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.